Autodesk.Navisworks.Api.VariantData
A value type that can store data of one of several different types.

Autodesk.Navisworks.Api.VariantData.#ctor
Creates Data with no value stored

Autodesk.Navisworks.Api.VariantData.#ctor(Autodesk.Navisworks.Api.NamedConstant)
Creates a named constant value
Throws System.ArgumentException:
Argument 'value' has been Disposed

Autodesk.Navisworks.Api.VariantData.#ctor(System.Boolean)
Creates a boolean value

Autodesk.Navisworks.Api.VariantData.#ctor(System.Double)
Creates a unitless double value

Autodesk.Navisworks.Api.VariantData.#ctor(System.Double,Autodesk.Navisworks.Api.VariantDataType)
Creates a specific type of double based value
value: Value to create
type: Particular type of double value to create
Throws System.ArgumentOutOfRangeException:
type is not a floating point based type

Autodesk.Navisworks.Api.VariantData.#ctor(System.Double,System.Double)
Creates a 2D point value

Autodesk.Navisworks.Api.VariantData.#ctor(System.Double,System.Double,System.Double)
Creates a 3D point value

Autodesk.Navisworks.Api.VariantData.#ctor(System.Int32)
Creates an integer value

Autodesk.Navisworks.Api.VariantData.#ctor(System.String)
Creates a display string value

Autodesk.Navisworks.Api.VariantData.#ctor(System.UInt32)
Creates an LtNat32 value

Autodesk.Navisworks.Api.VariantData.#ctor(System.UInt64)
Creates an LtNat64 value

Autodesk.Navisworks.Api.VariantData.DataType
Type of value stored
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.VariantData.ElementName
The XML element name used for XML serialization

Autodesk.Navisworks.Api.VariantData.Equals(System.Object)
Determines whether the specified object and the current object refer to the same
underlying native object. Returns false if either object has been disposed.

Autodesk.Navisworks.Api.VariantData.FromBoolean(System.Boolean)
Creates a boolean value

Autodesk.Navisworks.Api.VariantData.FromDateTime(System.DateTime)
Creates a System.DateTime value

Autodesk.Navisworks.Api.VariantData.FromDisplayString(System.String)
Creates a display string value

Autodesk.Navisworks.Api.VariantData.FromDouble(System.Double)
Creates a unitless double value

Autodesk.Navisworks.Api.VariantData.FromDoubleAngle(System.Double)
Creates a double angle value

Autodesk.Navisworks.Api.VariantData.FromDoubleArea(System.Double)
Creates a double area value

Autodesk.Navisworks.Api.VariantData.FromDoubleLength(System.Double)
Creates a double length value

Autodesk.Navisworks.Api.VariantData.FromDoubleVolume(System.Double)
Creates a double volume value

Autodesk.Navisworks.Api.VariantData.FromIdentifierString(System.String)
Creates an identifier string value
Throws System.ArgumentException:
Argument 'value' is not convertable to a 7-bit ASCII string

Autodesk.Navisworks.Api.VariantData.FromInt32(System.Int32)
Creates a 32 bit integer value

Autodesk.Navisworks.Api.VariantData.FromInt64(System.Int64)
Creates a 64 bit integer value

Autodesk.Navisworks.Api.VariantData.FromNamedConstant(Autodesk.Navisworks.Api.NamedConstant)
Creates a named constant value
Throws System.ArgumentException:
Argument 'value' has been Disposed

Autodesk.Navisworks.Api.VariantData.FromNat32(System.UInt32)
Creates a Nat32 value

Autodesk.Navisworks.Api.VariantData.FromNat64(System.UInt64)
Creates a Nat64 value

Autodesk.Navisworks.Api.VariantData.FromNone
Creates Data with no value stored

Autodesk.Navisworks.Api.VariantData.FromPoint2D(Autodesk.Navisworks.Api.Point2D)
Creates a Point2D value

Autodesk.Navisworks.Api.VariantData.FromPoint2D(System.Double,System.Double)
Creates a 2D point value

Autodesk.Navisworks.Api.VariantData.FromPoint3D(Autodesk.Navisworks.Api.Point3D)
Creates a Point3D value

Autodesk.Navisworks.Api.VariantData.FromPoint3D(System.Double,System.Double,System.Double)
Creates a 3D point value

Autodesk.Navisworks.Api.VariantData.GetHashCode
Serves as a hash function for a particular type.  is suitable for use in hashing algorithms and data structures like a hash table.
Returns: A hash code for the current .

Autodesk.Navisworks.Api.VariantData.IsAnyDouble
Is data any type of double based value ?
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.VariantData.IsBoolean
Is data a boolean value ?
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.VariantData.IsDateTime
Is data a System.DateTime value ?
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.VariantData.IsDisplayString
Is data a display string value ?
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.VariantData.IsDouble
Is data a unitless double value ?
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.VariantData.IsDoubleAngle
Is data a double angle value ?
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.VariantData.IsDoubleArea
Is data a double area value ?
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.VariantData.IsDoubleLength
Is data a double length value ?
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.VariantData.IsDoubleVolume
Is data a double volume value ?
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.VariantData.IsIdentifierString
Is data an identifier string value ?
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.VariantData.IsInt32
Is data a unitless 32 bit integer value ?
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.VariantData.IsInt64
Is data an int64?
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.VariantData.IsNamedConstant
Is data a named constant value ?
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.VariantData.IsNat32
Is data an LtNat32?
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.VariantData.IsNat64
Is data an LtNat64?
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.VariantData.IsNone
Does data have no value ?
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.VariantData.IsPoint2D
Is data a 2D point?
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.VariantData.IsPoint3D
Is data a 3D point?
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.VariantData.IsReadOnly
Gets a value indicating whether the object is read-only.

Autodesk.Navisworks.Api.VariantData.ReadFromXml(System.String,System.String,System.Boolean)
Create a VariantData object from serialised XML values

Autodesk.Navisworks.Api.VariantData.ToAnyDouble
Access any type of double value
Throws System.NotSupportedException:
Not supported if '!IsAnyDouble'
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.VariantData.ToBoolean
Access boolean value
Throws System.NotSupportedException:
Not supported if '!IsBoolean'
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.VariantData.ToDateTime
Access System.DateTime value
Throws System.NotSupportedException:
Not supported if '!IsDateTime'
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.VariantData.ToDisplayString
Access display string value
Throws System.NotSupportedException:
Not supported if '!IsDisplayString'
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.VariantData.ToDouble
Access unitless double value
Throws System.NotSupportedException:
Not supported if '!IsDouble'
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.VariantData.ToDoubleAngle
Access double angle value
Throws System.NotSupportedException:
Not supported if '!IsDoubleAngle'
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.VariantData.ToDoubleArea
Access double area value
Throws System.NotSupportedException:
Not supported if '!IsDoubleArea'
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.VariantData.ToDoubleLength
Access double length value
Throws System.NotSupportedException:
Not supported if '!IsDoubleLength'
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.VariantData.ToDoubleVolume
Access double volume value
Throws System.NotSupportedException:
Not supported if '!IsDoubleVolume'
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.VariantData.ToIdentifierString
Access identifier string value
Throws System.NotSupportedException:
Not supported if '!IsIdentifierString'
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.VariantData.ToInt32
Access 32 bit integer value
Throws System.NotSupportedException:
Not supported if '!IsInt32'
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.VariantData.ToInt64
Access Int64 value
Throws System.NotSupportedException:
Not supported if '!IsInt64'
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.VariantData.ToNamedConstant
Access named constant value
Throws System.NotSupportedException:
Not supported if '!IsNamedConstant'
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.VariantData.ToNat32
Access LtNat32 value
Throws System.NotSupportedException:
Not supported if '!IsNat32'
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.VariantData.ToNat64
Access LtNat64 value
Throws System.NotSupportedException:
Not supported if '!IsNat64'
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.VariantData.ToPoint2D
Access Point2D value

Autodesk.Navisworks.Api.VariantData.ToPoint3D
Access Point3D value

Autodesk.Navisworks.Api.VariantData.ToSerializableString(System.String@)
Write serializable string representation
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.VariantData.ToString
Returns a  that represents the current .
Returns: A  that represents the current .

Autodesk.Navisworks.Api.VariantData.XmlAttribName
The XML attribute name used for XML serialization

Autodesk.Navisworks.Api.VariantData.XmlAttribValue(System.String@)
The XML attribute value used for XML serialization
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.VariantData.XmlElementContent(System.String@,System.Boolean)
The XML element content used for XML serialization
Throws System.ObjectDisposedException:
Object has been Disposed